# LeaderRightAttachment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LeaderRightAttachment Property
ParameterTypeId Class See Also
---
"Right Attachment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LeaderRightAttachment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LeaderRightAttachment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LeaderRightAttachment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace